# To run: brew bundle or brew bundle --file="~/Brewfile"
tap "aws/tap"
tap "denji/nginx"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
tap "xd-homebrew/versions", "git@git.corp.adobe.com:WebPA/xd-homebrew-versions"


brew "atool"
brew "automake"
brew "bat"
brew "node"
brew "bitwarden-cli"
brew "brew-cask-completion"
brew "caddy"
brew "glib"
brew "pcre"
brew "python@3.9"
brew "coreutils"
brew "guile"
brew "libidn2"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "clang-format"
brew "cmake"
brew "cocoapods", link: false
brew "cowsay"
brew "folly"
brew "elinks"
brew "exa"
brew "exiftool"
brew "fd"
brew "harfbuzz"
brew "libass"
brew "srt"
brew "ffmpeg"
brew "fzf"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-gui"
brew "gnu-sed"
brew "gobject-introspection"
brew "netpbm"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "highlight"
brew "htop"
brew "hunspell"
brew "hyperfine"
brew "shared-mime-info"
brew "libheif"
brew "python@3.8"
brew "libraw"
brew "imagemagick"
brew "ios-sim"
brew "jq"
brew "libcaca"
brew "libksba"
brew "lynx"
brew "mas"
brew "media-info"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "nvm"
brew "poppler"
brew "pv"
brew "qt"
brew "ranger"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "sourcekitten"
brew "speedtest-cli"
brew "starship"
brew "swiftformat"
brew "the_silver_searcher"
brew "tmux"
brew "todo-txt"
brew "transmission-cli"
brew "tree"
brew "vault"
brew "vim"
brew "w3m"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "aws/tap/aws-sam-cli"
brew "denji/nginx/nginx-full", args: ["with-debug", "with-rtmp-module"]
brew "jesseduffield/lazygit/lazygit"
brew "mongodb/brew/mongodb-community"


cask "anydesk"
cask "audacity"
cask "bitwarden"
cask "db-browser-for-sqlite"
cask "fanny"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "maccy"
cask "meld"
cask "michaelvillar-timer"
cask "sublime-text"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "wireshark"


mas "Edge Runner", id: 1219655804
mas "Fantastical", id: 975937182
mas "Free Ruler", id: 1483172210
mas "GarageBand", id: 682658836
mas "IP Scanner", id: 404167149
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835

# Mac app store
# to search for mas: `mas search xcode`
# to install: `mas install <id>`
# mas 'Slack', id: 803453959
